// #include <stdio.h>

// int main(){

//    int n =5;
   
//     for(int i=1;i<=10; i++) {
//         printf("%d X %d = %d\n", n ,i , n*i );
//         //n =n+1;
//     }
    
   



//     return 0;
// }

#include <stdio.h>
int main(){
 int n, i;
 //for(n = 1; n <= 20; n = n + 1) n  er  man 1 teke 20 porjonto barbe 
 for(n=1;n<=20;n=n+1)
  {
    for(i = 1; i <= 10; i = i + 1) {
        printf("%d X %d = %d\n", n, i, n*i);
 }
 }
 return 0;
} 
//for(n=1;n<=20;n=n+1)
// এটি বাইরের for লুপ।

// n = 1 দিয়ে লুপের শুরুর মান ১ ধরা হয়েছে।

// n <= 20 শর্ত দেওয়া হয়েছে, অর্থাৎ n এর মান ২০ হওয়া পর্যন্ত লুপটি মোট ২০ বার ঘুরবে।

// n = n + 1 (বা n++) দিয়ে প্রতিটি ধাপ শেষে n এর মান ১ করে বাড়ানো হয়েছে।

// . ইনার লুপ (Inner Loop - ভেতরের লুপ):

// C
//         for(i = 1; i <= 10; i = i + 1) {
// ব্যাখ্যা:

// এটি নেস্টেড বা ভেতরের for লুপ।

// বাইরের লুপ n এর প্রতিটি ১টি মানের জন্য, এই ভেতরের লুপটি ১ থেকে ১০ পর্যন্ত মোট ১০ বার ঘুরবে।

// i = 1 দিয়ে শুরু হয়ে i <= 10 পর্যন্ত চলবে এবং প্রতি ধাপে i এর মান ১ করে বাড়বে।